In [9]:
# 7 practical
#Classification Techniquies-Decision Tree
import pandas as pd
from sklearn.tree import DecisionTreeClassifier
from sklearn.model_selection import train_test_split
from sklearn import metrics
import numpy as np

In [10]:
df=pd.read_csv("Titanic-Dataset.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [11]:
a=df['Age'].mean()
a

29.712885154061624

In [12]:
c=df['Age'].replace('NA',np.nan,inplace=True)
c
df['Age'].fillna(value=a,inplace=True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [13]:
from sklearn.preprocessing import LabelEncoder
Label=LabelEncoder()

In [14]:
l=df.iloc[:,3]
l
Z=Label.fit_transform(l)
az=pd.Series(Z)
az

0      108
1      190
2      353
3      272
4       15
      ...
886    548
887    303
888    413
889     81
890    220
Length: 891, dtype: int32

In [15]:
m=df.iloc[:,8]
m
L=Label.fit_transform(m)
L
bl=pd.Series(L)
bl

0      523
1      596
2      669
3       49
4      472
      ...
886    101
887     14
888    675
889      8
890    466
Length: 891, dtype: int32

In [16]:
n=df.iloc[:,10]
n
M=Label.fit_transform(n)
M
cm=pd.Series(M)
cm

0      147
1       81
2      147
3       55
4      147
      ...
886    147
887     30
888    147
889     60
890    147
Length: 891, dtype: int32

In [17]:
X=pd.concat((az,bl),axis=1)
X
abc=X.rename(columns={0:'Name',1:'Ticket'})
abc

     Name  Ticket
0     108     523
1     190     596
2     353     669
3     272      49
4      15     472
..    ...     ...
886   548     101
887   303      14
888   413     675
889    81       8
890   220     466

[891 rows x 2 columns]

In [20]:
X= X.rename(str,axis="columns")
X

       0    1
0    108  523
1    190  596
2    353  669
3    272   49
4     15  472
..   ...  ...
886  548  101
887  303   14
888  413  675
889   81    8
890  220  466

[891 rows x 2 columns]

In [19]:
Y=df.iloc[:,1]

In [21]:
X_train,X_test,y_train,y_test=train_test_split(X,Y,test_size = 0.23,random_state = 1)
clf=DecisionTreeClassifier(criterion="entropy",max_depth=3)
clf=clf.fit(X_train,y_train)
y_pred=clf.predict(X_test)
print("Accuracy:",metrics.accuracy_score(y_test,y_pred))

Accuracy: 0.6780487804878049

C:\Users\arpit\anaconda3\lib\site-packages\sklearn\utils\validation.py:623: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if not hasattr(array, "sparse") and array.dtypes.apply(is_sparse).any():
C:\Users\arpit\anaconda3\lib\site-packages\sklearn\utils\validation.py:623: FutureWarning: is_sparse is deprecated and will be removed in a future version. Check `isinstance(dtype, pd.SparseDtype)` instead.
  if not hasattr(array, "sparse") and array.dtypes.apply(is_sparse).any():